In [1]:
import pandas as pd

In [3]:
data = {
    'DateOfBirth': [2002, 2007, 1976, 1976],
    'Name': ["Ravshan", "Gulshan", "Feruza", "Muxiddin"],
    'Temp': [4, 5, 7, 9]
}

df = pd.DataFrame(data)

In [6]:
df

   DateOfBirth      Name  Temp
0         2002   Ravshan     4
1         2007   Gulshan     5
2         1976    Feruza     7
3         1976  Muxiddin     9

In [7]:
df.drop(3)

   DateOfBirth     Name  Temp
0         2002  Ravshan     4
1         2007  Gulshan     5
2         1976   Feruza     7

In [8]:
df

   DateOfBirth      Name  Temp
0         2002   Ravshan     4
1         2007   Gulshan     5
2         1976    Feruza     7
3         1976  Muxiddin     9

In [9]:
df.drop(0, inplace=True)

In [10]:
df

   DateOfBirth      Name  Temp
1         2007   Gulshan     5
2         1976    Feruza     7
3         1976  Muxiddin     9

In [11]:
df.drop([1, 2])

   DateOfBirth      Name  Temp
3         1976  Muxiddin     9

In [12]:
df.drop('Temp', axis='columns')

   DateOfBirth      Name
1         2007   Gulshan
2         1976    Feruza
3         1976  Muxiddin